{
    "0": {
        "dateStart": null,
        "dateEnd": null,
        "alert": "Welcome to Tournament Stream Helper!\nThis program is made possible because of great efforts from @joao_shino and the community such as @MathiasWolfbrok specially with testing and contributions to game assets.\nBe sure to check out the readme on GitHub for your initial setup and contribute with game assets if possible. If you have any questions, issues, suggestions or just want to see what other people are doing with TSH, check out our Discord channel!\nWe hope you have a great experience with TSH!"
    },
    "2": {
        "dateStart": null,
        "dateEnd": 1683460289,
        "alert": "WARNING FOR 5.2 and 5.21 USERS:\n\nThe updater on Tournament Stream Helper 5.2 and 5.21 is broken, if you want to update the software to 5.22 and above please download the latest Github release and extract all files except the layout and user_data folders to your TSH install folder."
    },
    "3": {
        "dateStart": null,
        "dateEnd": 1683583537,
        "alert": "WARNING:\n\nSTARTGG SUPPORT IS CURRENTLY BROKEN ON TSH DUE TO MAJOR CHANGES ON THE PLAYER DATA API.\nAll imports and data (Bracket, player data, set selector, top 8, etc.) are affected\n\nWe are currently investigating the situation and will push a fix as soon as possible. Thank you for your patience.\nIn the meantime, remember that data can still be manually inputted in the software."
    },
    "4": {
        "dateStart": null,
        "dateEnd": 1707507578,
        "alert": "WARNING:\n\nA MAJOR OUTAGE IS CURRENTLY OCCURING ON THE ASSET REPOSITORY.\nAsset Downloads are currently no longer available in the Asset Downloader.\nPlease visit https://github.com/joaorb64/TournamentStreamHelper/issues/704 for more information and potential workarounds."
    },
    "5": {
        "dateStart": null,
        "dateEnd": 1707850800,
        "alert": "UPDATE:\n\nWe are now fairly confident that the asset repository outage is now over, and asset packs should now once again be available from both the Asset Downloader and the Asset Portal. Thank you for your patience."
    },
    "6": {
        "dateStart": null,
        "dateEnd": 1718697216,
        "alert": "WARNING:\n\nDO NOT UPDATE TOURNAMENT STREAM HELPER TO 5.801\n\nWe have been able to identify a critical issue which prevents the program from being ran. We are currently investigating the root cause. Affected users can revert back to 5.8 through this link: https://github.com/joaorb64/TournamentStreamHelper/releases/tag/5.8\n\nWe apologize for the inconvenience."
    },
    "7": {
        "dateStart": null,
        "dateEnd": 1730479931,
        "alert": "WARNING:\n\nREGARDING STARTGG\nStartGG is currently exhibiting new things on its API TSH was not prepared to handle, which may cause extra crashes when loading sets from there. We will be pinging back once the fix for this is released.\n\nREGARDING CHALLONGE\nIf you are trying to load a tournament from Challonge, the program may hang for a bit (should be less than 5 min, depending on your connection) when first inputting the bracket, or when you open the program with a Challonge bracket already loaded in. If this happens, DO NOT PANIC AND LET THE PROGRAM WORK, at least for the said 5 min timeframe. This is because we have to try to bypass the Cloudfare protection which is present on both Challonge as a website and its API. We will try to move those retries in the background at some point, but given the API situation, as well as the lack of trackable stats data, we recommend against the use of Challonge for your tournaments if you can help it, even though we know that StartGG is sluggish and you should definitely never enable timed checkins on this webste if your playerbase isn’t used to checking in before matches.\n\nOn a side note, if someone is willing to make a contribution to add support for a different website, such at Tonamel, Battlefy or RoundOne, we’re definitely interested\n\nPS: We’re also still looking for a backend team for the TSH rewrite, if you know anybody feel free to pass the word around"
    },
    "8": {
        "dateStart": null,
        "dateEnd": 1731196800,
        "alert": "WARNING:\n\nREGARDING STARTGG\nA new update for Tournament Stream Helper (v5.831) is now available and should alleviate recent crashes related to StartGG API changes. Make sure to download this version ASAP if you are using StartGG.\n\nREGARDING CHALLONGE\nIf you are trying to load a tournament from Challonge, the program may hang for a bit (should be less than 5 min, depending on your connection) when first inputting the bracket, or when you open the program with a Challonge bracket already loaded in. If this happens, DO NOT PANIC AND LET THE PROGRAM WORK, at least for the said 5 min timeframe. This is because we have to try to bypass the Cloudfare protection which is present on both Challonge as a website and its API. We will try to move those retries in the background at some point, but given the API situation, as well as the lack of trackable stats data, we recommend against the use of Challonge for your tournaments if you can help it, even though we know that StartGG is sluggish and you should definitely never enable timed checkins on this webste if your playerbase isn’t used to checking in before matches.\n\nOn a side note, if someone is willing to make a contribution to add support for a different website, such at Tonamel, Battlefy or RoundOne, we’re definitely interested\n\nPS: We’re also still looking for a backend team for the TSH rewrite, if you know anybody feel free to pass the word around"
    }
}